---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.ContinuousrailBeginBottomExtension
source: html/a34edbcd-f9cd-c171-e058-1d748403c2a5.htm
---
# Autodesk.Revit.DB.GroupTypeId.ContinuousrailBeginBottomExtension Property

Extension (Beginning/Bottom).

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailBeginBottomExtension { get; }
```